app/controllers/characters_controller.rb

SELECT "characters".* FROM "characters"
---
  def index
    characters = Character.all

INSERT INTO "characters" ("name", "game", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Starfox"], ["game", "Starfox"], ["created_at", "2020-09-17 15:44:36.614298"], ["updated_at", "2020-09-17 15:44:36.614298"]]
---
  def create
    character = Character.create!(character_params)

SELECT "characters".* FROM "characters" WHERE "characters"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
DELETE FROM "characters" WHERE "characters"."id" = $1  [["id", 6]]
---
  def destroy
    character = Character.find(params[:id])
    character.destroy